bench-results-ft-communicator-ep-8gpu/logs/bench-ag-rs-decode-20260715-141019.log
Writing benchmark result to bench-results-ft-communicator-ep-8gpu/ag-rs-decode-20260715-141023.json
Warning: You are sending unauthenticated requests to the HF Hub. Please set a HF_TOKEN to enable higher rate limits and faster downloads.
`rope_parameters`'s factor field must be a float >= 1, got 40
`rope_parameters`'s beta_fast field must be a float, got 32
`rope_parameters`'s beta_slow field must be a float, got 1
`rope_parameters`'s factor field must be a float >= 1, got 40
`rope_parameters`'s beta_fast field must be a float, got 32
`rope_parameters`'s beta_slow field must be a float, got 1
`rope_parameters`'s factor field must be a float >= 1, got 40
`rope_parameters`'s beta_fast field must be a float, got 32
`rope_parameters`'s beta_slow field must be a float, got 1
`rope_parameters`'s factor field must be a float >= 1, got 40
`rope_parameters`'s beta_fast field must be a float, got 32
`rope_parameters`'s beta_slow field must be a float, got 1
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x7ff8d08b0c20>, trust_remote_code=False, seed=0, num_prompts=512, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=False, custom_output_len=256, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=1024, random_output_len=128, random_range_ratio='0.0', random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, speed_bench_dataset_subset='qualitative', speed_bench_output_len=4096, speed_bench_category=None, label=None, backend='openai', base_url=None, host='127.0.0.1', port=8000, endpoint='/v1/completions', header=None, max_concurrency=256, model='deepseek-ai/DeepSeek-V2-Lite-Chat', input_len=128, output_len=1024, tokenizer=None, tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=inf, burstiness=1.0, disable_tqdm=False, num_warmups=64, profile=False, save_result=True, save_detailed=False, append_result=False, metadata=['config=ag-rs', 'workload=decode', 'tp=1', 'dp=8', 'model=deepseek-ai/DeepSeek-V2-Lite-Chat', 'dtype=bfloat16', 'max_model_len=4096', 'max_num_batched_tokens=4096', 'all2all_backend=allgather_reducescatter'], result_dir='bench-results-ft-communicator-ep-8gpu', result_filename='ag-rs-decode-20260715-141023.json', ignore_eos=True, percentile_metrics=None, metric_percentiles='99', goodput=None, request_id_prefix='bench-ace1132a-', top_p=None, top_k=None, min_p=None, temperature=None, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, lora_assignment='random', ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=1800, extra_body=None, skip_tokenizer_init=False, insecure=False, plot_timeline=False, timeline_itl_thresholds='25,50', plot_dataset_stats=False)
INFO 07-15 14:10:35 [utils.py:90] Sampling input_len from [128, 128] and output_len from [1024, 1024]
WARNING: vllm bench serve no longer sets temperature==0 (greedy) in requests by default. The default will be determined on the server side and can be model/API specific. For the old behavior, include --temperature=0.
Starting initial single prompt test run...
Waiting for endpoint to become up in 1800 seconds
 |          | 00:00 elapsed, 00:32 remainingWARNING 07-15 14:10:36 [ready_checker.py:70] Endpoint is not ready. Error='aiohttp.client_exceptions.ClientConnectorError: Cannot connect to host 127.0.0.1:8000 ssl:default [Connect call failed ('127.0.0.1', 8000)]'
 |          | 00:05 elapsed, 29:54 remainingWARNING 07-15 14:10:41 [ready_checker.py:70] Endpoint is not ready. Error='aiohttp.client_exceptions.ClientConnectorError: Cannot connect to host 127.0.0.1:8000 ssl:default [Connect call failed ('127.0.0.1', 8000)]'
 |          | 00:10 elapsed, 29:49 remainingWARNING 07-15 14:10:46 [ready_checker.py:70] Endpoint is not ready. Error='aiohttp.client_exceptions.ClientConnectorError: Cannot connect to host 127.0.0.1:8000 ssl:default [Connect call failed ('127.0.0.1', 8000)]'
 |          | 00:15 elapsed, 29:44 remainingWARNING 07-15 14:10:51 [ready_checker.py:70] Endpoint is not ready. Error='aiohttp.client_exceptions.ClientConnectorError: Cannot connect to host 127.0.0.1:8000 ssl:default [Connect call failed ('127.0.0.1', 8000)]'
 |          | 00:20 elapsed, 29:39 remainingWARNING 07-15 14:10:56 [ready_checker.py:70] Endpoint is not ready. Error='aiohttp.client_exceptions.ClientConnectorError: Cannot connect to host 127.0.0.1:8000 ssl:default [Connect call failed ('127.0.0.1', 8000)]'
 |▏         | 00:25 elapsed, 29:34 remainingWARNING 07-15 14:11:01 [ready_checker.py:70] Endpoint is not ready. Error='aiohttp.client_exceptions.ClientConnectorError: Cannot connect to host 127.0.0.1:8000 ssl:default [Connect call failed ('127.0.0.1', 8000)]'
 |▏         | 00:30 elapsed, 29:29 remainingWARNING 07-15 14:11:06 [ready_checker.py:70] Endpoint is not ready. Error='aiohttp.client_exceptions.ClientConnectorError: Cannot connect to host 127.0.0.1:8000 ssl:default [Connect call failed ('127.0.0.1', 8000)]'
 |▏         | 00:35 elapsed, 29:24 remainingWARNING 07-15 14:11:11 [ready_checker.py:70] Endpoint is not ready. Error='aiohttp.client_exceptions.ClientConnectorError: Cannot connect to host 127.0.0.1:8000 ssl:default [Connect call failed ('127.0.0.1', 8000)]'
 |▏         | 00:40 elapsed, 29:19 remainingWARNING 07-15 14:11:16 [ready_checker.py:70] Endpoint is not ready. Error='aiohttp.client_exceptions.ClientConnectorError: Cannot connect to host 127.0.0.1:8000 ssl:default [Connect call failed ('127.0.0.1', 8000)]'
 |▎         | 00:45 elapsed, 29:14 remainingWARNING 07-15 14:11:21 [ready_checker.py:70] Endpoint is not ready. Error='aiohttp.client_exceptions.ClientConnectorError: Cannot connect to host 127.0.0.1:8000 ssl:default [Connect call failed ('127.0.0.1', 8000)]'
 |▎         | 00:50 elapsed, 29:09 remainingWARNING 07-15 14:11:26 [ready_checker.py:70] Endpoint is not ready. Error='aiohttp.client_exceptions.ClientConnectorError: Cannot connect to host 127.0.0.1:8000 ssl:default [Connect call failed ('127.0.0.1', 8000)]'
 |▎         | 00:55 elapsed, 29:04 remainingWARNING 07-15 14:11:31 [ready_checker.py:70] Endpoint is not ready. Error='aiohttp.client_exceptions.ClientConnectorError: Cannot connect to host 127.0.0.1:8000 ssl:default [Connect call failed ('127.0.0.1', 8000)]'
 |▎         | 01:00 elapsed, 28:59 remainingWARNING 07-15 14:11:36 [ready_checker.py:70] Endpoint is not ready. Error='aiohttp.client_exceptions.ClientConnectorError: Cannot connect to host 127.0.0.1:8000 ssl:default [Connect call failed ('127.0.0.1', 8000)]'
 |▎         | 01:05 elapsed, 28:54 remainingWARNING 07-15 14:11:41 [ready_checker.py:70] Endpoint is not ready. Error='aiohttp.client_exceptions.ClientConnectorError: Cannot connect to host 127.0.0.1:8000 ssl:default [Connect call failed ('127.0.0.1', 8000)]'
 |▍         | 01:10 elapsed, 28:49 remainingWARNING 07-15 14:11:46 [ready_checker.py:70] Endpoint is not ready. Error='aiohttp.client_exceptions.ClientConnectorError: Cannot connect to host 127.0.0.1:8000 ssl:default [Connect call failed ('127.0.0.1', 8000)]'
 |▍         | 01:15 elapsed, 28:44 remainingWARNING 07-15 14:11:51 [ready_checker.py:70] Endpoint is not ready. Error='aiohttp.client_exceptions.ClientConnectorError: Cannot connect to host 127.0.0.1:8000 ssl:default [Connect call failed ('127.0.0.1', 8000)]'
 |▍         | 01:20 elapsed, 28:39 remainingWARNING 07-15 14:11:56 [ready_checker.py:70] Endpoint is not ready. Error='aiohttp.client_exceptions.ClientConnectorError: Cannot connect to host 127.0.0.1:8000 ssl:default [Connect call failed ('127.0.0.1', 8000)]'
 |▍         | 01:25 elapsed, 28:34 remainingWARNING 07-15 14:12:01 [ready_checker.py:70] Endpoint is not ready. Error='aiohttp.client_exceptions.ClientConnectorError: Cannot connect to host 127.0.0.1:8000 ssl:default [Connect call failed ('127.0.0.1', 8000)]'
 |▌         | 01:30 elapsed, 28:29 remainingWARNING 07-15 14:12:06 [ready_checker.py:70] Endpoint is not ready. Error='aiohttp.client_exceptions.ClientConnectorError: Cannot connect to host 127.0.0.1:8000 ssl:default [Connect call failed ('127.0.0.1', 8000)]'
 |▌         | 01:35 elapsed, 28:24 remainingWARNING 07-15 14:12:11 [ready_checker.py:70] Endpoint is not ready. Error='aiohttp.client_exceptions.ClientConnectorError: Cannot connect to host 127.0.0.1:8000 ssl:default [Connect call failed ('127.0.0.1', 8000)]'
 |▌         | 01:45 elapsed, 29:59 remaining
Initial test run completed.
Warming up with 64 requests...
100%|██████████| 64/64 [00:12<00:00,  5.23it/s]
Warmup run completed.
Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 256
100%|██████████| 512/512 [00:53<00:00,  9.50it/s]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     512       
Failed requests:                         0         
Maximum request concurrency:             256       
Benchmark duration (s):                  53.87     
Total input tokens:                      65536     
Total generated tokens:                  524288    
Request throughput (req/s):              9.50      
Output token throughput (tok/s):         9732.32   
Peak output token throughput (tok/s):    17514.00  
Peak concurrent requests:                512.00    
Total token throughput (tok/s):          10948.86  
---------------Time to First Token----------------
Mean TTFT (ms):                          1101.17   
Median TTFT (ms):                        731.29    
P99 TTFT (ms):                           1721.40   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          25.24     
Median TPOT (ms):                        25.37     
P99 TPOT (ms):                           25.91     
---------------Inter-token Latency----------------
Mean ITL (ms):                           25.24     
Median ITL (ms):                         25.08     
P99 ITL (ms):                            36.69     
==================================================